#Pandas
A python library to deal with sequential and tabular data. 

It has two types of data structures:

1. Series- It is 1D labelled array capable of holding datatypes like int, float, objects. Axis labels are colllectively called as index. Python series is nothing but colums in excel sheets.

2. Dataframes- It is a hereterogenous 2D objects which stores data in rows and columns.

#Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
ds = pd.Series(dtype=object)
ds

Series([], dtype: object)

In [3]:
data = np.array(['M','E','G','A'])
pd.Series(data)

0    M
1    E
2    G
3    A
dtype: object

In [4]:
m = ['Max',12,8*4,9/3]
pd.Series(m)

0    Max
1     12
2     32
3      3
dtype: object

In [5]:
n = {'a':1,'b':2,'c':4}
pd.Series(n)

a    1
b    2
c    4
dtype: int64

In [6]:
ds1 = pd.Series(np.random.randn(5))
ds1

0    0.441221
1    0.510141
2    0.188305
3   -0.201125
4    0.263344
dtype: float64

In [7]:
r = pd.Series(data)
print (r[:2])

0    M
1    E
dtype: object

In [8]:
print (r[:4])

0    M
1    E
2    G
3    A
dtype: object

In [9]:
print (r[-1:])

3    A
dtype: object

In [10]:
g = pd.Series(data, index=range(10,14))
g

10    M
11    E
12    G
13    A
dtype: object

In [11]:
e = pd.Series([9,8,6,7], index=['a','b','c','d'])
f = pd.Series({'a':3, 'b':6, 'c':9,'d':2})
print (e,f)

a    9
b    8
c    6
d    7
dtype: int64 a    3
b    6
c    9
d    2
dtype: int64

In [12]:
e.add(f)

a    12
b    14
c    15
d     9
dtype: int64

In [13]:
s1 = pd.Series(f)
s2 = pd.Series([1,2,3,4])

s1 + s2

a   NaN
b   NaN
c   NaN
d   NaN
0   NaN
1   NaN
2   NaN
3   NaN
dtype: float64

#Pandas Dataframes

It is an heterogeneous 2D objects which stores data in rows and columns.

In [14]:
import pandas as pd
import numpy as np

df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [15]:
print(df,type(df))

Empty DataFrame
Columns: []
Index: [] <class 'pandas.core.frame.DataFrame'>

In [16]:
a = pd.DataFrame(columns=['a','b','c','d','e'],index=range(1,6))
a

     a    b    c    d    e
1  NaN  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN  NaN

In [17]:
data = {'apple':[7,9,3,4],'orange':[7,2,4,1]}

In [18]:
purchase = pd.DataFrame(data)
purchase

   apple  orange
0      7       7
1      9       2
2      3       4
3      4       1

In [19]:
customers = pd.DataFrame(data, index = ['Mira', 'Axel','Sven','Harry'])
customers

       apple  orange
Mira       7       7
Axel       9       2
Sven       3       4
Harry      4       1

In [20]:
date = {'apple': range(1,5),'orange':range(5,9)}
index = pd.DatetimeIndex(['2021-03-09','2021-12-23','2021-09-11','2021-12-31'])

In [21]:
pd.DataFrame(date, index=index)

            apple  orange
2021-03-09      1       5
2021-12-23      2       6
2021-09-11      3       7
2021-12-31      4       8

In [22]:
#task: create a dataframe of random numbers with 10 rows and columns as A,B,C,D,E
x = {
  'A':np.random.randn(10),
  'B':np.random.randn(10),
  'C':np.random.randn(10),
  'D':np.random.randn(10),
  'E':np.random.randn(10)
}
a = pd.DataFrame(x)
a

          A         B         C         D         E
0  0.693577  0.551442 -0.766614 -0.621500  1.262280
1  0.331477 -0.598185 -2.096519 -0.367621 -0.807306
2  0.128152 -0.483583  1.329374  0.169685 -0.752027
3  0.319063  1.737407  0.199511 -0.057665 -0.797318
4  0.484058 -0.447430  0.231524 -0.740351  1.710223
5  0.746633  1.770555  0.789442  0.467981 -0.936338
6  1.334388  1.360448 -0.682100 -0.640456 -2.746564
7  0.990563  0.761690 -0.885189  1.256768 -2.662994
8  2.262003 -0.694941  0.049659 -0.499560  0.034107
9 -0.523461 -1.367655 -0.440812  0.348512  0.651964